# 1 Ejercicios con Pandas

In [2]:
import pandas as pd

**Ejercicio 1:** Crear una serie de pandas con el siguiente arreglo

In [4]:
edades=[22, 13, 8, 33, 25, 44, 38, 22]

In [6]:
serie = pd.Series(edades)
serie

0    22
1    13
2     8
3    33
4    25
5    44
6    38
7    22
dtype: int64

**Ejercicio 2:** Obtener los primeros 5 registros utilizando head, y los últimos 3 utilizando tail

In [9]:
serie.head()

0    22
1    13
2     8
3    33
4    25
dtype: int64

In [10]:
serie.tail()

3    33
4    25
5    44
6    38
7    22
dtype: int64

**EJercicio 3:** Obtener el valor mínimo, el máximo y el promedio en la serie.

In [11]:
serie.max()

44

In [12]:
serie.min()

8

In [13]:
serie.mean()

25.625

**Ejercicio 4:** Obtener el valor en la segunda posición de la serie

In [17]:
# Ambas formas son válidas
serie[1]
serie.get(1) #es recomendable usar esta función propia de pandas

13

**Ejercicio 5:** Obtener registros con valor igual a 22

In [25]:
#Se aplica un filtro
print(serie==22)
serie[serie==22]

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

0    22
7    22
dtype: int64

**Ejercicio 6:** Crear una segunda sertie utilizando los siguientes datos:

In [29]:
edades2 = [23,15,12,25,20,50,31,2]
serie2 = pd.Series(edades2)
serie2

0    23
1    15
2    12
3    25
4    20
5    50
6    31
7     2
dtype: int64

In [30]:
# Sumando ambas Series
# Pandas suma los elementos de las series
serie + serie2

0    45
1    28
2    20
3    58
4    45
5    94
6    69
7    24
dtype: int64

In [31]:
# Python, en cambio, crea una lista mas grande con todos los elementos
edades + edades2

[22, 13, 8, 33, 25, 44, 38, 22, 23, 15, 12, 25, 20, 50, 31, 2]

In [35]:
# Además Pandas puede sumar series de distintos tamaños
# NaN(Not a Number) nos indicia que la operación no se pudo hacer
serie3 = pd.Series([18])
serie3 + serie

0    40.0
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64

**Ejercicio 7:** Reordenar la serie2 invirtiendo los índices con sort_index()

In [37]:
serie2 = serie2.sort_index(ascending=False)
serie2

7     2
6    31
5    50
4    20
3    25
2    12
1    15
0    23
dtype: int64

In [39]:
# Pandas no suma por el orden visual de los elementos
# Pandas suma por el orden de "index", por esto el resultado es el mismo que la
# suma de series anterior
serie + serie2

0    45
1    28
2    20
3    58
4    45
5    94
6    69
7    24
dtype: int64

**Ejercicio 8:** Restar a todos los elementos de la primera serie 5 unidades

In [40]:
serie-5

0    17
1     8
2     3
3    28
4    20
5    39
6    33
7    17
dtype: int64

In [41]:
serie

0    22
1    13
2     8
3    33
4    25
5    44
6    38
7    22
dtype: int64

**Ejercicio 9:** Calcular el cuadrado de todos los valores utilizando map

In [42]:
# Primero definimos una función
def cuadrado(a):
    return a*a

# Usamos la función map para aplicar la función a todos los elementos
serie.map(cuadrado)

0     484
1     169
2      64
3    1089
4     625
5    1936
6    1444
7     484
dtype: int64

# 2 Dataframes (Parte 1)

In [6]:
import pandas as pd

In [7]:
datos = {
    "nombre":       ["Argentina", "Brasil", "Chile", "Colombia", "Ecuador", "Paraguay", "Peru"],
    "capital":      ["Buenos Aires", "Brasilia", "Santiago de Chile", "Bogotá", "Quito", "Asunción", "Lima"],
    "poblacion":    [45380000, 212600000, 19120000, 50880000, 17640000, 7133000, 32970000],
    "sup. en  km2": [2780000, 8516000, 756950, 1143000, 283560, 406752, 1285216],
}

In [8]:
paises = pd.DataFrame(datos)
paises

      nombre            capital  poblacion  sup. en  km2
0  Argentina       Buenos Aires   45380000       2780000
1     Brasil           Brasilia  212600000       8516000
2      Chile  Santiago de Chile   19120000        756950
3   Colombia             Bogotá   50880000       1143000
4    Ecuador              Quito   17640000        283560
5   Paraguay           Asunción    7133000        406752
6       Peru               Lima   32970000       1285216

**Ejercicio 10:** Visualizar los primeros 5 y los últimos 3 elementos del DataFrame

In [9]:
paises.head()

      nombre            capital  poblacion  sup. en  km2
0  Argentina       Buenos Aires   45380000       2780000
1     Brasil           Brasilia  212600000       8516000
2      Chile  Santiago de Chile   19120000        756950
3   Colombia             Bogotá   50880000       1143000
4    Ecuador              Quito   17640000        283560

In [11]:
paises.tail(3)

     nombre   capital  poblacion  sup. en  km2
4   Ecuador     Quito   17640000        283560
5  Paraguay  Asunción    7133000        406752
6      Peru      Lima   32970000       1285216

In [12]:
# Forma alternativa de mostrar datos con el lenguaje estándar de python
paises[:5]

      nombre            capital  poblacion  sup. en  km2
0  Argentina       Buenos Aires   45380000       2780000
1     Brasil           Brasilia  212600000       8516000
2      Chile  Santiago de Chile   19120000        756950
3   Colombia             Bogotá   50880000       1143000
4    Ecuador              Quito   17640000        283560

**Ejercicio 11:** Crear un Dataframe utilizando el diccionario únicamente con las columnanos nombre y población.

In [15]:
paises2 = pd.DataFrame(datos, columns=["nombre", "poblacion"])
paises2

      nombre  poblacion
0  Argentina   45380000
1     Brasil  212600000
2      Chile   19120000
3   Colombia   50880000
4    Ecuador   17640000
5   Paraguay    7133000
6       Peru   32970000

**Ejercicio 12:** Crear un Dataframe utilizando el diccionario con la columna "nombre" como índice:

In [18]:
paises3 = pd.DataFrame(datos, index=datos["nombre"], columns=["capital", "poblacion", "sup. en  km2"])
paises3

                     capital  poblacion  sup. en  km2
Argentina       Buenos Aires   45380000       2780000
Brasil              Brasilia  212600000       8516000
Chile      Santiago de Chile   19120000        756950
Colombia              Bogotá   50880000       1143000
Ecuador                Quito   17640000        283560
Paraguay            Asunción    7133000        406752
Peru                    Lima   32970000       1285216

**Ejercicio 13:** Obtener los datos de la fila con el índice "Argentina"

In [20]:
paises3.loc["Argentina"]

capital         Buenos Aires
poblacion           45380000
sup. en  km2         2780000
Name: Argentina, dtype: object

**Ejercicio 13:** Obtener la población y capital de Argentina y Brasil utilizando la función loc

In [21]:
paises3.loc[["Argentina", "Brasil"], ["poblacion", "capital"]]

           poblacion       capital
Argentina   45380000  Buenos Aires
Brasil     212600000      Brasilia

**Ejercicio 13:** Obtener información de paises con una superficie mayor a 1M de km2 utilizando la función loc

In [22]:
# El uso de ":" indica que queremos buscar en todos los elementos
paises3.loc[:, ["sup. en  km2"]]

           sup. en  km2
Argentina       2780000
Brasil          8516000
Chile            756950
Colombia        1143000
Ecuador          283560
Paraguay         406752
Peru            1285216

In [26]:
# Formas alternativa de mostrar una sola columna de un dataframe
paises3.poblacion
paises3["poblacion"] #forma recomendada

Argentina     45380000
Brasil       212600000
Chile         19120000
Colombia      50880000
Ecuador       17640000
Paraguay       7133000
Peru          32970000
Name: poblacion, dtype: int64

In [31]:
# Mostrando paises con una superficie mayor a 1M de km2
paises3.loc[paises3["sup. en  km2"]>1000000]

                capital  poblacion  sup. en  km2
Argentina  Buenos Aires   45380000       2780000
Brasil         Brasilia  212600000       8516000
Colombia         Bogotá   50880000       1143000
Peru               Lima   32970000       1285216